STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB05KZ/Applications/BLE/BLE_DirectionFinding_Peripheral_Tag/STM32_BLE/App/app_ble.c
      /* Start Fast or Low Power Advertising */

      /* Set advertising configuration for legacy advertising */
      status = aci_gap_set_advertising_configuration(0,
                                                     GAP_MODE_GENERAL_DISCOVERABLE,
                                                     HCI_ADV_EVENT_PROP_CONNECTABLE,
                                                     paramA,
                                                     paramB,
                                                     HCI_ADV_CH_ALL,
                                                     0,
                                                     NULL, /* No peer address */
                                                     HCI_ADV_FILTER_NONE,
                                                     0, /* 0 dBm */
                                                     HCI_PHY_LE_1M, /* Primary advertising PHY */
                                                     0, /* 0 skips */
                                                     HCI_PHY_LE_1M, /* Secondary advertising PHY. Not used with legacy advertising. */
                                                     0, /* SID */
                                                     0 /* No scan request notifications */);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("==>> aci_gap_set_advertising_configuration - fail, result: 0x%02X\n", status);
      }
      else
      {
        bleAppContext.Device_Connection_Status = (APP_BLE_ConnStatus_t)paramC;
        APP_DBG_MSG("==>> Success: aci_gap_set_advertising_configuration\n");
      }

      status = aci_gap_set_advertising_data(0, ADV_COMPLETE_DATA, sizeof(a_AdvData), (uint8_t*) a_AdvData);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("==>> aci_gap_set_advertising_data Failed, result: 0x%02X\n", status);
      }
      else
      {
        APP_DBG_MSG("==>> Success: aci_gap_set_advertising_data\n");
      }

      /* Enable advertising */
      status = aci_gap_set_advertising_enable(ENABLE, 1, &Advertising_Set_Parameters);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("==>> aci_gap_set_advertising_enable Failed, result: 0x%02X\n", status);
      }
      else
      {
        APP_DBG_MSG("==>> Success: aci_gap_set_advertising_enable\n");
      }

      break;
    }/* PROC_GAP_PERIPH_ADVERTISE_START_FAST */
    /* USER CODE END GAP_PERIPHERAL_2 */
    default:
      break;
  }
  return;
}

/* USER CODE BEGIN FD*/

/* USER CODE END FD*/

static void gap_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}

static void gap_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}
/* USER CODE BEGIN FD_LOCAL_FUNCTION */


static void Switch_OFF_GPIO(void *arg)
{
  BSP_LED_Off(LD2);
  return;
}


void hci_le_connection_iq_report_event(hci_le_connection_iq_report_event_rp0 *event)
{
  printf("Connection Handle: 0x%04X\n", event->Connection_Handle);
  printf("RX PHY: 0x%02X\n", event->RX_PHY);
  printf("Data Channel Index: 0x%02X\n", event->Data_Channel_Index);
  printf("RSSI: %d (0.1 dBm)\n", event->RSSI);
  printf("RSSI Antenna ID: 0x%02X\n", event->RSSI_Antenna_ID);
  printf("CTE Type: 0x%02X\n", event->CTE_Type);
  printf("Slot Durations: 0x%02X\n", event->Slot_Durations);
  printf("Packet Status: 0x%02X\n", event->Packet_Status);
  printf("Connection Event Counter: 0x%04X\n", event->Connection_Event_Counter);
  printf("Sample Count: 0x%02X\n", event->Sample_Count);

  printf("IQ samples: ");
  for (int i = 0; i < event->Sample_Count; i++)
  {
    printf("(%d,%d)", event->Samples[i].I_Sample, event->Samples[i].Q_Sample);
  }
  printf("\n");
}


void hci_le_cte_request_failed_event(uint8_t Status, uint16_t Connection_Handle)
{
  printf("CTE Request failed 0x%02X.\n", Status);
  
}


/* USER CODE END FD_LOCAL_FUNCTION */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
#if (CFG_BUTTON_SUPPORTED == 1)
void APPE_Button1Action(void)
{
  if(bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_SERVER)
  {
    APP_DBG_MSG("Already connected.\n");
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_CONN_TERMINATE);
  }

  if (bleAppContext.Device_Connection_Status == APP_BLE_IDLE)
  {
    APP_DBG_MSG("Relaunch advertising\n");
    /* Relaunch advertising */  
    //APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST_ONLY_CONNECTABLE);   
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST);
  }

  return;
}

void APPE_Button2Action(void)
{
  
  return;
}

void APPE_Button3Action(void)
{

  return;
}
#endif /* (CFG_BUTTON_SUPPORTED == 1) */
/* USER CODE END FD_WRAP_FUNCTIONS */

/** \endcond
 */
